/*
 *   기본 
 *     = 1~4장 
 *     = 1장 ==> 4,5page / 29page / 30page 
 *     
 *       실행 방법 (컴파일 , 인터프리터) 
 *                | javac  | java
 *       자바 특징 
 *         이식성이 좋다 (모든 운영체제에서 실행이 가능 
 *         자동 메모리 해제 (가비지 컬렉션) => 필요시엔 직접 호출 (System.gc())
 *         객체 지향 프로그램 : 조립식 (메인보드)
 *                          | Spring => CBD
 *                          | 이력서 => 산출물 
 *         풍부한 라이브러리가 존재 
 *       설치 (자바 JDK , 편집기) 
 *            jdk.java.net => jdk21 => 자바 개발 툴 
 *            eclipse.org => J2EE (Java , Web) => 편집기 
 *            => path : c:\\jdk-21\bin
 *            => classpath : .;c:\\jdk-21\lib 
 *            => java -version 
 *               java 
 *               javac 
 *       주의점 / 주석 
 *          => 1. 모든 프로그램은 main()을 필요로 한다
 *                            | 시작점
 *          => 프로그램은 컴퓨터에 명령을 수행하게 만든다
 *                            ---------
 *                            | 저장 => 출력 
 *                            | 명령이 끝나면 반드시 ; 
 *          => 클래스명과 파일명이 동일해야 된다 
 *          => 가급적이면 한글명을 사용하지 않는다 
 *          => 주석 : 번역이 안되는 파트 => 알아보기 쉽게
 *             여러줄 주석 "/ *  * /" => ctrl + shift + /
 *                                 => ctrl + shift + \
 *             한줄 주석 // => ctrl + / 
 *             
 *             4,5page / 29page / 30page
 *                                | 문장 종료시 ;
 *                       | 주석 
 *               | 자바 특징 
 *             | 실행 과정 
 *               원시소스 (개발자만 알아본다)
 *                                 컴퓨터가 인식 
 *                                 바이트 코드        
 *               A.java  ========  A.class ======= 실행
 *                        javac              java
 *                         |                   |
 *                       기계어로 변경          한줄씩 읽어서 출력 
 *                       => 컴파일             => 인터프리터 
 *          1) 재사용 
 *          2) 가독성 
 *          3) 확장성 => 리팩토링 
 *             데이터 저장 : n 
 *                        name 
 *          ------------------ 유지보수성 
 *          
 *     = 2장 
 *       데이터 저장 방법 / 한개 저장 : 변수 / 상수 
 *       ----- 저장 크기 : 데이터형 
 *     = 3장 
 *       연산처리 (단항 , 이항 , 삼항) 
 *     = 4장 
 *       프로그램 제어 (제어문) 
 *     ---------------------------- 핵심 (묶어서 관리)
 */
// => 소스 암기(X) => 프로그램의 순서 
public class 자바동작과정 {

	public static void main(String[] args) {
		// 화면에 출력 명령 
		System.out.println("Hello Java");
	}

}
