/*
 *   비트연산자 
 *      &   |    ^  
 *      --  --   --
 *               => 다른 비트 찾기 
 *          => +
 *      => *
 *           &
 *      0 0  0
 *      0 1  0
 *      1 0  0
 *      1 1  1
 *      
 *        => 35 & 20
 *           -------
 *           
 *           100011
 *           010100
 *           ------&
 *           000000  => 0
 *           
 *           28 & 10 
 *           -------
 *           11100
 *           01010
 *           ------ &
 *           01000  => 8
 *      => |
 *         0 0 => 0
 *         0 1 => 1
 *         1 0 => 1
 *         1 1 => 1
 *         
 *         100011
 *         010100
 *         ------|
 *         110111  ==> 55
 *         
 *         11100
 *         01010
 *         ------|
 *         11110 ==> 30
 *         
 *      => ^
 *         0 0 = 0
 *         1 0 = 1
 *         0 1 = 1
 *         1 1 = 0
 *         
 *         100011
 *         010100
 *         ------- ^
 *         110111 => 55
 *         
 *         11100
 *         01010
 *         ------- ^
 *         10110  => 22
 *         
 *      비트이동연산자 
 *        << , >> 
 *        
 *        10<<2 ==> 40
 *        101000
 *        
 *        x<<y  => x*2^y
 *        
 *        10>>2
 *        1010 => 10 => 2
 *        x>>y  => x/2^y
 *        
 *        이진법 Integer.toBinaryString(정수)
 *        
 *        1) 연산자 
 *           1. 증감연산자 
 *           2. 형변환연산자 
 *           3. 산술연산자 
 *           ----------------
 *           4. 비교연산자 
 *           5. 논리연산자 
 *           6. 대입연산자 
 *           ---------------  연산자 활용 : 제어문 => 메소드 => 클래스
 *           
 *         
 */
public class 이항연산자_비트연산자_비트이동연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        System.out.println(Integer.toBinaryString(100) ); // 2
        System.out.println(Integer.toOctalString(100) ); // 8
        System.out.println(Integer.toHexString(100) ); // 16
        // 0x / 0 / 0b
        System.out.println(0b1010);
	}

}
