/*
 * 		변수 => 데이터형 (146page)
 * 				 |
 * 			-----------
 * 			|         |
 * 		  기본형     참조형(메모리 주소)
 * 		  ----     ----
 * 					| 배열
 * 					| 클래스
 * 					 -----
 * 					   |
 * 					---------------
 * 					|			   |
 * 				라이브러리			사용자 정의 클래스
 * 								------------- 객체 지향
 * 
 * 		정수: byte / int / long
 * 		실수: double => (SpringAI = float)
 * 		논리: boolean
 * 		문자: char ==> String으로 대체
 * 	------------------------------------------------------
 * 		연산자: 단항(++ / -- / ! / (type)
 * 			  이항(산술 / 비교 / 논리 / 대입)
 * 				  산술 : + - * / %
 * 				  비교 : == != < > <= >= 
 * 				  논리 : && ||
 * 				  대입 : = += -=
 * 			  삼항  (조건)? 값:값
 *		제어문
 *			조건문: if / if~else
 *			선택문: switch~case
 *			반복문: for / while
 *				  --- 이차 for => 배열
 *			반복제어문: break
 *	-------------------------------------------------------
 *
 *		=> 참조형 : 여러개 데이터를 한 메모리에 저장 => 사용
 *		=> 자바 메모리 구조
 *			----------------------------------
 *				MathodArea => method / static
 *			-------------------------------
 *				Stack => 메모리 자체 관리 => 지역변수
 *			----------------------------------
 *				Heap => 개발자가 관리 => 참조형변수
 *						|=> GarbageCollection GC
 *					저장 : new => mollac()
 *					해제 : delete => free() => 승격
 *			----------------------------------
 *
 *			String s="Java"
 *          String s1="Java"
 *			 Stack		     Heap(실제 데이터 저장공간)
 *			---s---      0x100--------
 *			 0x100             "Java"
 *			-------           --------
 *					 ↗
 *			--s1---	     0x200--------
 *							   "Java"
 *			-------		s==s1 --------
 *
 *			String s2=new String("Java");
 *
 *			---s2--
 *			 0x200
 *			-------		new => 새로운 메모리 공간을 만들어서 저장
 *						=> 단점: 가독성 / 결합성이 높다
 *								---------------- new 사용하지 않는다
 *								=> 리플랙션
 *
 *			String 클래스 => char[]을 제어
 *						   ----------- 여러개의 문자를 저장하는 클래스
 *						   String => "" / char => ''
 *				| => 변경해서 사용할 수 없다 / 있는 그대로 제공한 내용을 사용
 *					 | final			 | => 표준화
 *				| => 일반 데이터형 / 참조형
 *					 ---------	 ---- 지원하는 메소드를 이용할 수 있다
 *					 String 변수명=""
 *	
 */
public class 문자열_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println();

	}

}
