/*
 * 	제어문
 * 	  => 프로그램 실행중에 흐름 변경(내용)
 *			=> 조건에 따라서 실행 변경 (조건,선택문)
 *								if , switch
 *			=> 같은 일을 반복(반복문)
 *							for / while / do~while
 *			=> 반복 중단 / 제외 (반복제어문)
 *							break / continue
 *	------------------------------------------
 *	1. 조건문 = 판단 => 조건에 따라서 실행할 결정
 *		if / if~else / if ~ else if ...
 *	------------------------------------------
 *	2. 값에 따라 선택 => 메뉴, 네트워크서버, 게임(key)
 *		switch
 *	------------------------------------------
 *	3. 반복문 => 목록 / 게시판 목록 / 상품 목록 / 맛집 목록
 *		for   : 반복 횟수가 지정
 *		while : 반복 획수를 알 수 없다
 *		------------------------- 선조건 검사
 *		do~while : 반드시 한번이상 수행 => 후조건 검사
 *	------------------------------------------
 *	4. 반복제어문 => 종료 / 건너뛴다
 *	   break / continue
 *	------------------------------------------
 *
 *	주의점
 *	 1) ;의 위치
 *		-------
 *		if(조건)
 *		실행문장1;
 *		-------
 *		실행문장2; ==> if소속문장이 아니다
 *
 *		if(조건)
 *		{
 *			실행문장1; 
 *			실행문장2;
 *		}
 *
 *		if(조건);
 *		{
 *			실행문장1; => 조건과 상관없이 무조건 수행
 *			실행문장2;
 *		}
 *
 *		==> 가장 많이 사용되는 연산자
 *			=> 비교연산자 / 논리연산자 / 부정연산자 => 조건
 *			   조건 : true / false
 *
 *		-------------------------------------------
 *		if => 조건이 true일때 실행 => false면 건너뛴다
 *			  => 오류처리
 *			
 * 
 */
public class 제어문요약 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
